// nickname-generator.js

export default class NicknameGenerator {
    private surnames: string[];
    private names: string[];
    private randomLength: number;

    constructor(options = {
        names: undefined,surnames: undefined,randomLength: 2
    }) {
        this.surnames = options.surnames || surnames;
        this.names = options.names || names;
        this.randomLength = options.randomLength || 2;
    }

    generateUniqueNickname() {
        let names = '';
        let surname = this.getRandomItem(this.surnames);

        for (let i = 0; i < this.randomLength; i++) {
            const character = this.getRandomItem(this.names);
            names += character;
        }

        return surname+names;
    }

    getRandomItem(array: string[]) {
        const index = Math.floor(Math.random() * array.length);
        return array[index];
    }
}
const surnames = [
    '赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈',
    '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '许',
    '何', '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏',
    '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水', '窦', '章',
    '云', '苏', '潘', '葛', '奚', '范', '彭', '郎', '鲁', '韦',
    '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳',
    '酆', '鲍', '史', '唐', '费', '廉', '岑', '薛', '雷', '贺',
    '倪', '汤',  '殷', '罗', '毕', '郝', '邬', '安', '常',
    '乐', '于', '时', '傅', '皮', '卞', '齐', '康', '伍', '余',
    '元', '卜', '顾', '孟', '平', '黄', '和', '穆', '萧', '尹',
    '姚', '邵', '湛', '汪', '祁', '毛', '禹', '狄', '米', '贝',
    '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞',
    '熊', '纪', '舒', '屈', '项', '祝', '董', '梁', '杜', '阮',
    '蓝',  '席', '季', '麻', '强', '贾', '路', '娄',
    '江', '童', '颜', '郭', '梅', '盛', '林',  '钟', '徐',
    '邱', '骆', '高', '夏', '蔡', '田', '樊', '胡', '凌', '霍',
    '虞', '万',  '柯',  '管', '卢', '莫',  '房',
      '丁', '宣',  '邓',
    '郁', '单',  '洪', '包', '诸', '左', '石', '崔', '吉',
    '钮', '龚', '程', '嵇', '邢', '裴', '陆',
    '荀',  '于',  '甄',
   '靳',   '井', '段', '富', '巫',
    '乌', '焦', '巴', '弓', '牧', '隗', '山', '谷', '车', '侯',
      '秋', '仲', '宫',
    '宁',     '武',
    '刘', '景', '詹', '龙', '叶', '欧',
     '沃', '利', '蔚', '越',  '隆', '师', '巩', '厍',
    '聂', '晁', '勾', '敖',  '冷',  '辛', '阚', '那',
    '简', '饶', '空', '曾',  '沙',  '养', '鞠', '须',
      '关',    '荆',  '游',
    '官', '欧'
];
const names = [
    '国', '山', '河', '城', '春', '草', '木',
     '原', '上', '草', '岁', '荣',
    '床', '前', '明', '月', '光', '疑', '地', '上', '霜',
    '远', '上', '寒', '山', '石', '径', '斜', '白', '云', '生', '处', '有',  '家',
    '大', '江', '东', '去', '浪', '淘', '尽', '千', '古',
    '东', '风', '夜', '放', '花', '千', '树', '更', '吹', '落', '星', '如', '雨',
    '明', '月', '几', '时', '有', '把', '酒', '问', '青', '天',
    '起', '舞', '弄', '清', '影', '何', '似', '在', '人', '间',
    '但', '愿', '长', '久', '千', '里', '共', '婵', '娟',
    '独', '坐', '幽', '篁', '里', '弹', '琴', '复', '长', '啸',
    '深', '林', '不', '知', '明', '月', '来', '相', '照',
    '花', '间', '一', '壶', '酒', '独', '酌', '无', '相', '亲',
    '举', '杯', '邀', '明', '月', '对', '影', '成', '三',
    '举', '头', '望', '明', '月', '低', '头', '思', '故', '乡',
    '明', '月', '松', '间', '照', '清', '泉', '石', '上', '流',
    '空', '山', '新', '雨', '后', '天', '气', '晚', '来', '秋',
    '竹', '喧', '归', '浣', '女', '莲', '动', '下', '渔', '舟',
    '风', '劲', '角', '弓', '鸣', '雄', '兔',  '扑', '朔',
    '雌', '兔', '眼', '迷', '离', '双', '兔', '傍', '地', '走',
    '安', '能', '辨', '我', '是',
    '白', '日', '依', '山', '尽', '黄', '河', '入', '海', '流',
      '千', '里',   '一',  '楼',
    '野', '旷', '天', '低', '树', '江', '清', '月', '近',
    '月', '落', '乌',  '霜', '满', '天', '江', '枫', '渔', '火', '对', '愁', '眠',
    '姑', '苏', '城', '外', '寒', '山', '寺', '夜', '半', '钟', '声', '到', '客', '船',
    '花', '开', '两', '朵', '各', '表', '一', '枝',
    '风', '吹', '花', '落', '流', '携', '将', '去',
    '飞', '流', '直', '下', '三', '千', '尺', '疑', '是', '银', '河', '落', '九', '天',
    '明', '月', '松', '间', '照', '清', '泉', '石', '上', '流',
    '空', '山', '不', '见',  '但', '闻',  '语', '响',
     '景', '深', '林', '复', '照', '青', '苔', '上',
    '明', '月', '松', '间', '照', '清', '泉', '石', '上', '流',
    '空', '山', '新', '雨', '后', '天', '气', '晚', '来', '秋',
    '竹', '喧', '归',  '莲', '动', '下', '渔', '舟',
    '意', '春', '芳', '歇', '王', '孙', '自', '可',

];